# Stack Buffer Overflow

---

## 스택 오버플로우 VS 스택 버퍼 오버플로

> 스택 오버플로우 ( Stack Overflow )
> 

---

스택 영역은 실행중에 크기가 `동적`으로 확장될 수 있다.

그러나 물리적인 메모리 크기는 정해져있기에 `무한히 확장될 수는 없다.`

스택 오버플로우는 `스택 영역`이 너무 많이 `확장`되서 발생하는 버그를 뜻한다.

> 스택 버퍼 오버플로우 ( Stack Buffer Overflow )
> 

---

스택에 위치한 버퍼에 `버퍼의 크기보다 많은` 데이터가 입력되어 발생하는 버그

위 취약점과 용어가 비슷하여 `혼동`하기 쉽지만, 이 둘은 전혀 다른 의미이기 때문에 주의해야한다.

## 버퍼 오버 플로우

---

### 버퍼란?

일상에서는 ‘완충 장치'라는 뜻으로 사용

컴퓨터 과학에서는 `‘데이터가 목적지로 이동되기 전에 보관되는 임시 저장소’`의 의미로 사용된다.

현대에는 데이터가 저장될 수 있는 모든 단위를 `버퍼 ( Buffer )`라고 한다.

### Buffer Overflow

버퍼 오버플로우는 문자 그대로 `버퍼가 넘치는 것`을 의미합니다.

버퍼는 제각기 다른 크기를 가지고 있다.

| int ( 정수 ) | 4byte |
| --- | --- |
| char ( 문자 ) | 1byte |

ex) 10byte인 char 배열에 20byte 만큼의 크기가 들어가려고 하면 BOF 발생

<aside>
📢 100mL 물컵에 200mL 물이 들어가려고 하는것과 동일 !!

</aside>

일반적으로 버퍼는 `메모리상에 연속`해서 할당되어 있으므로,

어느 한 버퍼에서 오버플로우가 발생하면, 뒤에 있는 버퍼들의 값이 `조작될 위험`이 있다.